set sdc_version 2.0

set_load -pin_load 0.5 [get_ports {P[0]}]
set_load -pin_load 0.5 [get_ports {P[1]}]
set_load -pin_load 0.5 [get_ports {P[2]}]
set_load -pin_load 0.5 [get_ports {P[3]}]
set_load -pin_load 0.5 [get_ports {P[4]}]
set_load -pin_load 0.5 [get_ports {P[5]}]
set_load -pin_load 0.5 [get_ports {P[6]}]
set_load -pin_load 0.5 [get_ports {P[7]}]
set_load -pin_load 0.5 [get_ports {P[8]}]
set_load -pin_load 0.5 [get_ports {P[9]}]
set_load -pin_load 0.5 [get_ports {P[10]}]
set_load -pin_load 0.5 [get_ports {P[11]}]
set_load -pin_load 0.5 [get_ports {P[12]}]
set_load -pin_load 0.5 [get_ports {P[13]}]
set_load -pin_load 0.5 [get_ports {P[14]}]
set_load -pin_load 0.5 [get_ports {P[15]}]
set_load -pin_load 0.5 [get_ports {P[16]}]
set_load -pin_load 0.5 [get_ports {P[17]}]
set_load -pin_load 0.5 [get_ports {P[18]}]
set_load -pin_load 0.5 [get_ports {P[19]}]
set_load -pin_load 0.5 [get_ports {P[20]}]
set_load -pin_load 0.5 [get_ports {P[21]}]
set_load -pin_load 0.5 [get_ports {P[22]}]
set_load -pin_load 0.5 [get_ports {P[23]}]
set_load -pin_load 0.5 [get_ports {P[24]}]
set_load -pin_load 0.5 [get_ports {P[25]}]
set_load -pin_load 0.5 [get_ports {P[26]}]
set_load -pin_load 0.5 [get_ports {P[27]}]
set_load -pin_load 0.5 [get_ports {P[28]}]
set_load -pin_load 0.5 [get_ports {P[29]}]
set_load -pin_load 0.5 [get_ports {P[30]}]
set_load -pin_load 0.5 [get_ports {P[31]}]


create_clock [get_ports clk] -period 20 -waveform {0 10}
set_clock_uncertainity 0.01 [get_clocks clk]

set_input_delay -clock clk 2 [get_ports clk]

set_input_delay -clock clk 2 [get_ports {a[0]}]
set_input_delay -clock clk 2 [get_ports {a[1]}]
set_input_delay -clock clk 2 [get_ports {a[2]}]
set_input_delay -clock clk 2 [get_ports {a[3]}]
set_input_delay -clock clk 2 [get_ports {a[4]}]
set_input_delay -clock clk 2 [get_ports {a[5]}]
set_input_delay -clock clk 2 [get_ports {a[6]}]
set_input_delay -clock clk 2 [get_ports {a[7]}]
set_input_delay -clock clk 2 [get_ports {a[8]}]
set_input_delay -clock clk 2 [get_ports {a[9]}]
set_input_delay -clock clk 2 [get_ports {a[10]}]
set_input_delay -clock clk 2 [get_ports {a[11]}]
set_input_delay -clock clk 2 [get_ports {a[12]}]
set_input_delay -clock clk 2 [get_ports {a[13]}]
set_input_delay -clock clk 2 [get_ports {a[14]}]
set_input_delay -clock clk 2 [get_ports {a[15]}]

set_input_delay -clock clk 2 [get_ports {b[0]}]
set_input_delay -clock clk 2 [get_ports {b[1]}]
set_input_delay -clock clk 2 [get_ports {b[2]}]
set_input_delay -clock clk 2 [get_ports {b[3]}]
set_input_delay -clock clk 2 [get_ports {b[4]}]
set_input_delay -clock clk 2 [get_ports {b[5]}]
set_input_delay -clock clk 2 [get_ports {b[6]}]
set_input_delay -clock clk 2 [get_ports {b[7]}]
set_input_delay -clock clk 2 [get_ports {b[8]}]
set_input_delay -clock clk 2 [get_ports {b[9]}]
set_input_delay -clock clk 2 [get_ports {b[10]}]
set_input_delay -clock clk 2 [get_ports {b[11]}]
set_input_delay -clock clk 2 [get_ports {b[12]}]
set_input_delay -clock clk 2 [get_ports {b[13]}]
set_input_delay -clock clk 2 [get_ports {b[14]}]
set_input_delay -clock clk 2 [get_ports {b[15]}]

set_output_delay -clock clk 2 [get_ports {o[0]}]
set_output_delay -clock clk 2 [get_ports {o[1]}]
set_output_delay -clock clk 2 [get_ports {o[2]}]
set_output_delay -clock clk 2 [get_ports {o[3]}]
set_output_delay -clock clk 2 [get_ports {o[4]}]
set_output_delay -clock clk 2 [get_ports {o[5]}]
set_output_delay -clock clk 2 [get_ports {o[6]}]
set_output_delay -clock clk 2 [get_ports {o[7]}]
set_output_delay -clock clk 2 [get_ports {o[8]}]
set_output_delay -clock clk 2 [get_ports {o[9]}]
set_output_delay -clock clk 2 [get_ports {o[10]}]
set_output_delay -clock clk 2 [get_ports {o[11]}]
set_output_delay -clock clk 2 [get_ports {o[12]}]
set_output_delay -clock clk 2 [get_ports {o[13]}]
set_output_delay -clock clk 2 [get_ports {o[14]}]
set_output_delay -clock clk 2 [get_ports {o[15]}]
set_output_delay -clock clk 2 [get_ports {o[16]}]
set_output_delay -clock clk 2 [get_ports {o[17]}]
set_output_delay -clock clk 2 [get_ports {o[18]}]
set_output_delay -clock clk 2 [get_ports {o[19]}]
set_output_delay -clock clk 2 [get_ports {o[20]}]
set_output_delay -clock clk 2 [get_ports {o[21]}]
set_output_delay -clock clk 2 [get_ports {o[22]}]
set_output_delay -clock clk 2 [get_ports {o[23]}]
set_output_delay -clock clk 2 [get_ports {o[24]}]
set_output_delay -clock clk 2 [get_ports {o[25]}]
set_output_delay -clock clk 2 [get_ports {o[26]}]
set_output_delay -clock clk 2 [get_ports {o[27]}]
set_output_delay -clock clk 2 [get_ports {o[28]}]
set_output_delay -clock clk 2 [get_ports {o[29]}]
set_output_delay -clock clk 2 [get_ports {o[30]}]
set_output_delay -clock clk 2 [get_ports {o[31]}]

set_clock_latency -source 0.5 [get_ports clk]
